---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCLinkDocumentExportScope Properties
IFCLinkDocumentExportScope Class See Also Send Feedback
---

The IFCLinkDocumentExportScope type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCLinkDocumentExportScope Class

Autodesk.Revit.DB.IFC Namespace